// ctrl k, ctrl c, ctrl u
// данные типа int; 
// инструкции описания переменных;
// операторы присваивания, if, if- else  любой вложенности и в любой последовательности;
// операции  +, – ,  *, = =, != , < 

// Неполное ;
void main()
{

    // if else
    int a1 = 1;

    if (a1 < 5) 
    {
        a1 = a1 + 1; // a1 = 2
        print (a1);
    } 
    else 
    {
        a1 = 2 // a1 = 2
    }

    // if-else  любой вложенности и в любой последовательности;
    

    
}
// Комментарий

// Закрытый комментарий
/*
    Закрытый комментарий
*/

// Неполный комментарий
/ Неполный комментарий

// Незакрытый комментарий
/* Незакрытый комментарий